const StaticDataModel = {
  namespace: 'staticData',
  state: {
    // 退款类型
    refundType: {
      1: '全额退款',
      2: '部分退款',
    },
    // 退款方式
    refundMethod: {
      1: '退款到余额',
      2: '线下退款',
    },
    // 补单类型
    complementType: {
      1: '充值',
      2: '提现',
      3: '核销',
    },
    // 补单代码
    supplementingCode: {
      1: {
        1: '银行卡',
        2: '微信',
        3: '支付宝',
        4: '退款转余额',
      },
      2: {
        1: '银行卡',
        2: '微信',
        3: '支付宝',
      },
      3: {
        1: '购买代金券',
        2: '转账',
        3: '病例付款',
      },
    },
    // 产生变化的余额类型 0 其他,1 账户余额,2 红包余额
    balanceType: {
      0: '其他',
      1: '账户余额',
      2: '红包余额',
    },
    // 收入支出 0 其他,1 支出,2 收入
    inOrOut: {
      0: '其他',
      1: '收入',
      2: '支出',
    },
    // 账单类型 -1 未指定 1 充值 2 消费 3 转账 4 提现 5 退款,6 冻结 7 解冻 8 激活
    tradeType: {
      '-1': '未指定',
      1: '充值',
      2: '消费',
      3: '转账',
      4: '提现',
      5: '退款',
      6: '冻结',
      7: '解冻',
      8: '激活',
      9: '核销',
    },
    // 支付方式 -1未指定，0账户余额 1 银行卡, 2 支付宝 ,3 微信,4 线下支付-系统补单,5 代金券，6 退款到余额 7 线下退款
    // 8  信用额度  9 退还信用额度 11 京东钱包
    payType: {
      '-1': '未指定',
      0: '账户余额',
      1: '银行卡',
      2: '支付宝',
      3: '微信',
      4: '线下支付-系统补单',
      5: '代金券',
      6: '退款到余额',
      7: '线下退款',
      8: '信用额度',
      9: '退还信用额度',
      11: '京东钱包',
      12: '分批付款',
      13: '银联857商户',
    },
    payThirdObj: {
      WeChat: '微信',
      Alipay: '支付宝',
      Bank: '银行卡',
      System: '系统支付',
      UnionPay: '银联支付',
      JD_PAY: '京东支付',
      '-1': '未指定',
    },
  },
};
export default StaticDataModel;
